//-----------------------------------------------------------------------------
// File: main.cpp
//-----------------------------------------------------------------------------
#include <direct.h>
#include "tkeys.h"
#include "functions.h"
//-----------------------------------------------------------------------------
using namespace std;
//-----------------------------------------------------------------------------
bool menu(int &button)
{
	button = 0;
	system("chcp 1251 > nul");
	system("cls");
	cout << "----------= Шифрование файлов =----------" << endl;
	cout << " 1. Сгенерировать ключи из файла \n";
	cout << " 2. Распечатать массив ключей \n";
	cout << " 3. Зашифровать/расшифровать файл \n";
	cout << " 4. Протестировать \n";
	cout << " 5. Вывести статистику по символу \n";
	cout << " 6. Выход \n";
	cout << "-----------------------------------------" << endl;
	cin >> button;
	if (button == 6) return 0;
	return 1;
}
//-----------------------------------------------------------------------------
int main() 
{
	//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	// НЕ РАБОТАЕТ ДЛЯ РЕЖИМА ОТЛАДКИ
	char curdir[1024];                // Временные переменные
	_getcwd(curdir, sizeof(curdir));  // Получаем текущую директорию
	string path = curdir;             // Копируем в наш путь
	path += "\\Data\\";               // Добавляем имя директории
	//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
	TKEYS *keys = NULL;
	string in = "", out = "", res = "";
	int button;
	while (menu(button)) 
	{
		switch (button)
		{
			//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
			case 1: // Генерация ключей из указанного файла
			{
				if (keys != NULL) delete keys;
				if (DEFAULT) in = "key.txt";
				else {
					cout << "Введите имя файла: ";
					cin >> in;
				}
				ifstream fkey;
				fkey.open(path + in);
				if (fkey.fail()) {
					cout << "Ошибка чтения файла\n";
				} else {
					keys = new TKEYS(fkey);
					fkey.close();
				}
				break;
			}
			//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
			case 2: // Вывод массива ключей на экран
			{
				if (keys != NULL) keys->print();
				else cout << "Ключи еще не сгенерированы!\n";
				break;
			}
			//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
			case 3: // Шифрование/дешифровка указанного файла
			{
				if (keys != NULL) {
					if (DEFAULT) {
						in = "in.txt";
						out = "out.txt";
						res = "res.txt";
					} else {
						cout << "Введите имя исходного файла: ";
						cin >> in;
						cout << "Введите имя выходного файла: ";
						cin >> out;
						cout << "Введите имя проверочного файла: ";
						cin >> res;
					}
					encryptFile(path + in, path + out, keys);
					encryptFile(path + out, path + res, keys);
				} else {
					cout << "Ключи еще не сгенерированы!\n";
				}
				break;
			}
			//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
			case 4: // Тестирование
			{
				cout << "Введите символ, чтобы узнать его код: ";
				char c = 'a';
				cin.ignore(7777, '\n'); 
				cin.get(c); 
				cout << (int)((unsigned char)c) << endl;
				break;
			}
			//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
			case 5: // Вывод статистики по указанному символу
			{
				char c;
				if (DEFAULT) {
					in = "in.txt";
					out = "out.txt";
					c = 'b';
				} else {
					cout << "Введите имя исходного файла: ";
					cin >> in;
					cout << "Введите имя выходного файла: ";
					cin >> out;
					cout << "Введите символ ASCII: ";
					cin.ignore(7777, '\n');
					cin.get(c);
				}
				printStat(path + in, path + out, c);
				break;
			}
			//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
			default:
				cout << "Нет такой операции\n";	
			//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
		}
		system("pause");
	}
	if (keys != NULL) delete keys; // Выход и завершение работы
	return 0;
}
//-----------------------------------------------------------------------------
//                                                      By SnipGhost 03.11.2016
//-----------------------------------------------------------------------------
