//-----------------------------------------------------------------------------
#ifndef TKEYS_H
#define TKEYS_H
//-----------------------------------------------------------------------------
#include <iostream>
#include <fstream>
#include <string>
#include <iomanip>
//-----------------------------------------------------------------------------
#define TERMINAL_COL 80  // Границы экрана для вывода
#define STEPALLOC 20     // Кол-во выделяемых элементов
#define DEFAULT 1        // Все настройки по умолчанию да/нет (1/0)
#define DEBUG 1          // Вывод отладочной информации да/нет (1/0)
//-----------------------------------------------------------------------------
using namespace std;
//-----------------------------------------------------------------------------
struct TKEYS // Структура для хранения и генерации ключей
{
	int *key;               // Массив ключей
	int size;               // Размер массива
	TKEYS(istream &input);  // Конструктор, генерирует ключи
	~TKEYS();               // Деструктор, следит за очисткой памяти
	void print();           // Печать ключей на экран
};
//-----------------------------------------------------------------------------
#endif /* TKEYS_H */                                 // By SnipGhost 03.11.2016
//-----------------------------------------------------------------------------